In [79]:
import pandas as pd
from pandas.tseries.offsets import MonthBegin

In [80]:
data2 = pd.read_csv('rbi_usd_to_inr.csv', parse_dates=['Date'])

In [81]:
data2.head()

        Date     Rate
0 2022-06-27  78.2890
1 2022-06-24  78.3308
2 2022-06-23  78.2662
3 2022-06-22  78.2115
4 2022-06-21  78.0861

In [82]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5764 entries, 0 to 5763
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5764 non-null   datetime64[ns]
 1   Rate    5764 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 90.2 KB

In [83]:
print(data2.Date.max())
print(data2.Date.min())

2022-06-27 00:00:00
1998-08-25 00:00:00

In [84]:
data2['Month'] = data2['Date'].apply(lambda x: MonthBegin(0).rollback(x))
g_data1 = data2.groupby(by='Month', as_index=False).mean()
g_data1['Rate'] = round(g_data1['Rate'], 2)
g_data1.rename({'Rate':'Month_Mean_Rate'}, axis=1, inplace=True)
merge_data = pd.merge(left=data2, right=g_data1, on='Month')

In [85]:
merge_data

           Date     Rate      Month  Month_Mean_Rate
0    2022-06-27  78.2890 2022-06-01            77.95
1    2022-06-24  78.3308 2022-06-01            77.95
2    2022-06-23  78.2662 2022-06-01            77.95
3    2022-06-22  78.2115 2022-06-01            77.95
4    2022-06-21  78.0861 2022-06-01            77.95
...         ...      ...        ...              ...
5759 1998-09-02  42.5297 1998-09-01            42.52
5760 1998-09-01  42.5206 1998-09-01            42.52
5761 1998-08-28  42.5405 1998-08-01            42.52
5762 1998-08-27  42.5297 1998-08-01            42.52
5763 1998-08-25  42.5007 1998-08-01            42.52

[5764 rows x 4 columns]

In [86]:
merge_data.to_csv('rbi_usd_inr_final.csv', index=False)